RSN/src/DataProcessors/RJM_МониторЗаданий/RJM_МониторЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>RJM_МониторЗаданий</name>
  <tabularSections>
    <name>РегламентныеЗаданияТЧ</name>
    <attributes>
      <name>ИмяБазыДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МетаданныеИмя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Расписание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасписаниеXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадания</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформацияОбОшибке</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Конец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RSN/src/Catalogs/RJM_ВебСервисы/RJM_ВебСервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RJM_ВебСервисы</name>
  <attributes>
    <name>АдресВебСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/DataProcessors/RJM_МониторЗаданий/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ОбновитьИнформациюОЗаданиях(Команда)
	
	СписокОшибок = Новый Массив;
	
	// сохраняем курсор
	ТекСтрокаПредыдущая = Элементы.РеглИмена.ТекущаяСтрока;
	
	// получаем список веб сервисов
	МассивВебСервисов = ПолучитьСписокВебСервисов();
	ПодготовитьТабличныеЧасти();
	
	Если МассивВебСервисов.Количество() > 0 Тогда
		КоличествоВебСервисов = МассивВебСервисов.Количество();
		ШагИндикатора = 100/КоличествоВебСервисов;
		ПрогрессИндикатора = 0;
		Для каждого ЭлементМассива из МассивВебСервисов Цикл
			Состояние("Получаем данные от веб сервиса (ИБ) " + ЭлементМассива, ПрогрессИндикатора);
			ОбновитьИнформациюОЗаданияхНаСервере(ЭлементМассива, СписокОшибок);		
			ПрогрессИндикатора = ПрогрессИндикатора + ШагИндикатора;
			ДобавитьРеглИмена(ЭлементМассива);
		КонецЦикла;		
	КонецЕсли;
	
	// сообщим что справочник веб сервисов пустой
	Если МассивВебСервисов.Количество() = 0 Тогда
		Сообщить("Справочник веб сервисов пуст, информация по веб сервисам (ИБ) не загружена");
	КонецЕсли;
	
	Для каждого ЭлОшибки из СписокОшибок Цикл
		Сообщить(ЭлОшибки);	
	КонецЦикла;
	
	// восстанавливаем курсор
	Если Элементы.РеглИмена.ТекущиеДанные = Неопределено И ТекСтрокаПредыдущая = Неопределено Тогда
		Элементы.РеглИмена.ТекущаяСтрока = 0;
	Иначе
		Элементы.РеглИмена.ТекущаяСтрока = ТекСтрокаПредыдущая + РеглИмена.Количество();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьТабличныеЧасти()
	Объект.РегламентныеЗаданияТЧ.Очистить();
	РеглИмена.Очистить();
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВебСервисов()
	МассивВебСервисов = Новый Массив;
	Выборка = Справочники.RJM_ВебСервисы.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивВебСервисов.Добавить(Выборка.Наименование);
	КонецЦикла;
	Возврат МассивВебСервисов;
КонецФункции

&НаСервере
Функция ДобавитьРеглИмена(ЭлементМассива)
	НоваяБаза = РеглИмена.Добавить();
	НоваяБаза.ИмяБазыДанных = ЭлементМассива;				
КонецФункции

&НаСервере
Процедура ОбновитьИнформациюОЗаданияхНаСервере(ЭлементМассива, СписокОшибок)
	
	// локальная переменная для хранения информации об ошибке
	ОписаниеОшибкиПодключения = "";
		
	// получим ссылку на веб сервис
	ЭлВебСервис = Справочники.RJM_ВебСервисы.НайтиПоНаименованию(ЭлементМассива);
	
	ПроксиСоединение = RJM_ОбщийМодуль.ПолучитьПроксиСоединение(ЭлВебСервис.АдресВебСервиса, ЭлВебСервис.ИмяПользователя, ЭлВебСервис.Пароль, ОписаниеОшибкиПодключения);	
	Если ПроксиСоединение = Неопределено Тогда
		СписокОшибок.Добавить(ОписаниеОшибкиПодключения);
		Возврат;
	КонецЕсли;
	ПакетXDTO = ПроксиСоединение.GetInformationAboutRegulatedJob();
	Для Каждого Стр Из ПакетXDTO.STRINGHEAD Цикл
		ТекСтрока = Объект.РегламентныеЗаданияТЧ.Добавить();			
		ТекСтрока.ИмяБазыДанных = ЭлВебСервис.Наименование;
		ЗаполнитьЗначенияСвойств(ТекСтрока, Стр);
		ТекСтрока.УникальныйИдентификатор = Новый УникальныйИдентификатор(Стр.УникальныйИдентификатор);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОРегламентномЗаданииПоКлючу(ИмяБазыДанных, УникальныйИдентификатор)
	
	ПроксиСоединение = ПолучитьПроксиСоединениеПереопределенный(ИмяБазыДанных, УникальныйИдентификатор);
	Если ПроксиСоединение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПакетXDTO = ПроксиСоединение.GetInformationAboutRegulatedJobByKey(Строка(УникальныйИдентификатор));
	Для каждого ЭлПакета из ПакетXDTO.STRINGHEAD Цикл
		ОтборСтроки = Новый Структура;
		ОтборСтроки.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор(ЭлПакета.УникальныйИдентификатор));
		НайденныеСтроки = Объект.РегламентныеЗаданияТЧ.НайтиСтроки(ОтборСтроки);	
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаТЧ = НайденныеСтроки.Получить(0);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЭлПакета);
			СтрокаТЧ.ИмяБазыДанных = ЭлПакета.Наименование;
			СтрокаТЧ.УникальныйИдентификатор = Новый УникальныйИдентификатор(ЭлПакета.УникальныйИдентификатор);			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РеглИменаИмяБазыДанныхПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	Если Элементы.РеглИмена.ТекущиеДанные <> Неопределено Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИмяБазыДанных", Элементы.РеглИмена.ТекущиеДанные.ИмяБазыДанных);
		Элементы.РегламентныеЗаданияСписок.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьИнформациюОЗаданиях(ЭтаФорма.Команды.Найти("ОбновитьИнформациюОЗаданиях"));
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНастройкиRJM(Команда)
	ФормаСписка = ПолучитьФорму("Справочник.RJM_ВебСервисы.ФормаСписка");
	ФормаСписка.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура РеглИменаПриАктивизацииСтроки(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура РегламентныеЗаданияРасписаниеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаРасписания = Элементы.РегламентныеЗаданияСписок.ТекущиеДанные;
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("УникальныйИдентификатор", СтрокаРасписания.УникальныйИдентификатор);
	НайденныеСтроки = Объект.РегламентныеЗаданияТЧ.НайтиСтроки(ОтборСтрок);
	ТекстРасписания = НайденныеСтроки.Получить(0).РасписаниеXML;
	Если ЗначениеЗаполнено(ТекстРасписания) Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстРасписания);
		Расписание = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Иначе 
		Расписание = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеРедактированияРегламентногоЗадания", ЭтаФорма, Новый Структура("ТекущаяСтрока", Элементы.РегламентныеЗаданияСписок.ТекущаяСтрока));
	Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРедактированияРегламентногоЗадания(Расписание, ДополнительныеПараметры) Экспорт
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Запись, Расписание);
	СтрокаРасписания = Объект.РегламентныеЗаданияТЧ.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("УникальныйИдентификатор", СтрокаРасписания.УникальныйИдентификатор);
	НайденныеСтроки = Объект.РегламентныеЗаданияТЧ.НайтиСтроки(ОтборСтрок);
	НайденныеСтроки.Получить(0).РасписаниеXML = Запись.Закрыть();
	СтрокаРасписания.Расписание = Строка(Расписание);	
КонецПроцедуры

&НаКлиенте
Процедура Включить(Команда)
	ТекСтрокаПредыдущая = Элементы.РеглИмена.ТекущаяСтрока;
	Если Элементы.РегламентныеЗаданияСписок.ТекущиеДанные <> Неопределено Тогда
		ВключитьНаСервере(Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.ИмяБазыДанных, Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.УникальныйИдентификатор);
		ОбновитьИнформациюОРегламентномЗаданииПоКлючу(Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.ИмяБазыДанных, Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;
	Элементы.РеглИмена.ТекущаяСтрока = ТекСтрокаПредыдущая;
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура ВключитьНаСервере(ИмяБазыДанных, УникальныйИдентификатор)	
	ПроксиСоединение = ПолучитьПроксиСоединениеПереопределенный(ИмяБазыДанных, УникальныйИдентификатор);		
	ПроксиСоединение.EnableRegulatedJob(Строка(УникальныйИдентификатор));
КонецПроцедуры
 
&НаКлиенте
Процедура Отключить(Команда)
	ТекСтрокаПредыдущая = Элементы.РеглИмена.ТекущаяСтрока;
	Если Элементы.РегламентныеЗаданияСписок.ТекущиеДанные <> Неопределено Тогда
		ОтключитьНаСервере(Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.ИмяБазыДанных, Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.УникальныйИдентификатор);
		ОбновитьИнформациюОРегламентномЗаданииПоКлючу(Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.ИмяБазыДанных, Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;
	Элементы.РеглИмена.ТекущаяСтрока = ТекСтрокаПредыдущая;
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура ОтключитьНаСервере(ИмяБазыДанных, УникальныйИдентификатор)
	ПроксиСоединение = ПолучитьПроксиСоединениеПереопределенный(ИмяБазыДанных, УникальныйИдентификатор);	
	ПроксиСоединение.DisableRegulatedJob(Строка(УникальныйИдентификатор));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроксиСоединениеПереопределенный(ИмяБазыДанных, УникальныйИдентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	RJM_ВебСервисы.АдресВебСервиса,
	|	RJM_ВебСервисы.ИмяПользователя,
	|	RJM_ВебСервисы.Пароль
	|ИЗ
	|	Справочник.RJM_ВебСервисы КАК RJM_ВебСервисы
	|ГДЕ
	|	RJM_ВебСервисы.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ИмяБазыДанных);	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ПроксиСоединение = RJM_ОбщийМодуль.ПолучитьПроксиСоединение(Выборка.АдресВебСервиса, Выборка.ИмяПользователя, Выборка.Пароль);	
	Возврат ПроксиСоединение;
	
КонецФункции

&НаКлиенте
Процедура УстановитьРасписаниеВУдаленнойБазе(Команда)
	ТекСтрокаПредыдущая = Элементы.РеглИмена.ТекущаяСтрока;
	Если Элементы.РегламентныеЗаданияСписок.ТекущиеДанные <> Неопределено Тогда
			УстановитьРасписаниеВУдаленнойБазеНаСервере(Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.ИмяБазыДанных, Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.УникальныйИдентификатор);			
			ОбновитьИнформациюОРегламентномЗаданииПоКлючу(Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.ИмяБазыДанных, Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;	
	Элементы.РеглИмена.ТекущаяСтрока = ТекСтрокаПредыдущая;
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура УстановитьРасписаниеВУдаленнойБазеНаСервере(ИмяБазыДанных, УникальныйИдентификатор)
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	НайденныеСтроки = Объект.РегламентныеЗаданияТЧ.НайтиСтроки(ОтборСтрок);
	ТекстРасписания = НайденныеСтроки.Получить(0).РасписаниеXML;

	ПроксиСоединение = ПолучитьПроксиСоединениеПереопределенный(ИмяБазыДанных, УникальныйИдентификатор);
	ПроксиСоединение.InstallNewSchedule(Строка(УникальныйИдентификатор), ТекстРасписания);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВФоне(Команда)
	ТекСтрокаПредыдущая = Элементы.РеглИмена.ТекущаяСтрока;
	Если Элементы.РегламентныеЗаданияСписок.ТекущиеДанные <> Неопределено Тогда
		ВыполнитьВФонеНаСервере(Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.ИмяБазыДанных, Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.УникальныйИдентификатор);
		ОбновитьИнформациюОРегламентномЗаданииПоКлючу(Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.ИмяБазыДанных, Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;
	Элементы.РеглИмена.ТекущаяСтрока = ТекСтрокаПредыдущая;
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВФонеНаСервере(ИмяБазыДанных, УникальныйИдентификатор)
	ПроксиСоединение = ПолучитьПроксиСоединениеПереопределенный(ИмяБазыДанных, УникальныйИдентификатор);
	ПроксиСоединение.ExecuteRegulatedJobNowInBackGround(Строка(УникальныйИдентификатор));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОЗадании(Команда)
	ТекСтрокаПредыдущая = Элементы.РеглИмена.ТекущаяСтрока;
	Если Элементы.РегламентныеЗаданияСписок.ТекущиеДанные <> Неопределено Тогда
			ОбновитьИнформациюОРегламентномЗаданииПоКлючу(Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.ИмяБазыДанных, Элементы.РегламентныеЗаданияСписок.ТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;	
	Элементы.РеглИмена.ТекущаяСтрока = ТекСтрокаПредыдущая;
	УстановитьОтбор();
КонецПроцедуры
